In [2]:
import pandas as pd
import numpy as np

In [9]:
book = pd.read_excel('Book1.xlsx', sheet_name ='Sheet2')

In [11]:
book.iloc[0,0] =34

In [12]:
book

   Train3  Speed3       City3
0      34     500      rampur
1  545643     123     kolkata
2  125464     297    bareilly
3  564523     456  antarctica

In [14]:
book.to_excel('Book1.xlsx', sheet_name ='Sheet2')